nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_api.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <assert.h>

#include <sys/types.h>
#include <shell/shell.h>

#include <modem/modem_info.h>

#include <posix/arpa/inet.h>
#include <net/net_ip.h>

#include "utils/net_utils.h"
#include "mosh_print.h"

#include "link_shell.h"
#include "link_shell_print.h"
#include "link_shell_pdn.h"
#include "link_api.h"

#include <nrf_modem_at.h>
#include <modem/at_cmd_parser.h>
#include <modem/at_params.h>

#define AT_CMD_BUFFER_LEN (CONFIG_AT_CMD_RESPONSE_MAX_LEN + 1)
#define AT_CMD_PDP_CONTEXTS_READ "AT+CGDCONT?"
#define AT_CMD_PDP_CONTEXTS_READ_PARAM_COUNT 12
#define AT_CMD_PDP_CONTEXTS_READ_CID_INDEX 1
#define AT_CMD_PDP_CONTEXTS_READ_PDP_TYPE_INDEX 2
#define AT_CMD_PDP_CONTEXTS_READ_APN_INDEX 3
#define AT_CMD_PDP_CONTEXTS_READ_PDP_ADDR_INDEX 4

#define AT_CMD_PDP_CONTEXT_READ_INFO \
	"AT+CGCONTRDP=%d" /* Use sprintf to add CID into command */
#define AT_CMD_PDP_CONTEXT_READ_INFO_PARAM_COUNT 20
#define AT_CMD_PDP_CONTEXT_READ_INFO_CID_INDEX 1
#define AT_CMD_PDP_CONTEXT_READ_INFO_DNS_ADDR_PRIMARY_INDEX 6
#define AT_CMD_PDP_CONTEXT_READ_INFO_DNS_ADDR_SECONDARY_INDEX 7
#define AT_CMD_PDP_CONTEXT_READ_INFO_MTU_INDEX 12

#define AT_CMD_PDP_CONTEXT_READ_RSP_DELIM "\r\n"

/* ****************************************************************************/

static void link_api_context_info_fill_activation_status(
	struct pdp_context_info_array *pdp_info)
{
	char buf[16] = { 0 };
	const char *p;
	char at_response_str[256];
	int ret;
	int ctx_cnt = pdp_info->size;
	struct pdp_context_info *ctx_tbl = pdp_info->array;

	ret = nrf_modem_at_cmd(at_response_str, sizeof(at_response_str), "AT+CGACT?");
	if (ret) {
		mosh_error("Cannot get PDP contexts activation states, err: %d", ret);
		return;
	}

	/* For each contexts: */
	for (int i = 0; i < ctx_cnt; i++) {
		/* Search for a string +CGACT: <cid>,<state> */
		snprintf(buf, sizeof(buf), "+CGACT: %d,1", ctx_tbl[i].cid);
		p = strstr(at_response_str, buf);
		if (p) {
			ctx_tbl[i].ctx_active = true;
		}
	}
}

/* ****************************************************************************/

struct pdp_context_info *link_api_get_pdp_context_info_by_pdn_cid(int pdn_cid)
{
	int ret;
	struct pdp_context_info_array pdp_context_info_tbl;
	struct pdp_context_info *pdp_context_info = NULL;

	ret = link_api_pdp_contexts_read(&pdp_context_info_tbl);
	if (ret) {
		mosh_error("cannot read current connection info: %d", ret);
		return NULL;
	}

	/* Find PDP context info for the requested CID */
	for (int i = 0; i < pdp_context_info_tbl.size; i++) {
		if (pdp_context_info_tbl.array[i].cid == pdn_cid) {
			pdp_context_info = calloc(1, sizeof(struct pdp_context_info));
			memcpy(pdp_context_info,
			       &(pdp_context_info_tbl.array[i]),
			       sizeof(struct pdp_context_info));
			break;
		}
	}

	if (pdp_context_info_tbl.array != NULL) {
		free(pdp_context_info_tbl.array);
	}
	return pdp_context_info;
}

int link_api_pdp_context_dynamic_params_get(struct pdp_context_info *populated_info)
{
	int ret = 0;
	struct at_param_list param_list = { 0 };
	size_t param_str_len;
	char *next_param_str;
	bool resp_continues = false;

	char at_response_str[MOSH_AT_CMD_RESPONSE_MAX_LEN + 1];
	char *at_ptr = at_response_str;
	char *tmp_ptr = at_response_str;
	int lines = 0;
	int iterator = 0;
	char dns_addr_str[AT_CMD_PDP_CONTEXT_READ_IP_ADDR_STR_MAX_LEN];

	char at_cmd_pdp_context_read_info_cmd_str[15];

	int family;
	struct in_addr *addr;
	struct in6_addr *addr6;

	sprintf(at_cmd_pdp_context_read_info_cmd_str,
		AT_CMD_PDP_CONTEXT_READ_INFO, populated_info->cid);
	ret = nrf_modem_at_cmd(at_response_str, sizeof(at_response_str), "%s",
			       at_cmd_pdp_context_read_info_cmd_str);
	if (ret) {
		mosh_error(
			"nrf_modem_at_cmd returned err: %d for %s",
			ret,
			at_cmd_pdp_context_read_info_cmd_str);
		return ret;
	}

	/* Check how many rows of info do we have: */
	while (strncmp(tmp_ptr, "OK", 2) &&
	       (tmp_ptr = strstr(tmp_ptr, AT_CMD_PDP_CONTEXT_READ_RSP_DELIM)) != NULL) {
		tmp_ptr += 2;
		lines++;
	}

	/* Parse the response */
	ret = at_params_list_init(&param_list, AT_CMD_PDP_CONTEXT_READ_INFO_PARAM_COUNT);
	if (ret) {
		mosh_error("Could not init AT params list, error: %d\n", ret);
		return ret;
	}

parse:
	resp_continues = false;
	ret = at_parser_max_params_from_str(at_ptr, &next_param_str, &param_list,
					    AT_CMD_PDP_CONTEXT_READ_INFO_PARAM_COUNT);
	if (ret == -EAGAIN) {
		resp_continues = true;
	} else if (ret == -E2BIG) {
		mosh_error("E2BIG, error: %d\n", ret);
	} else if (ret != 0) {
		mosh_error(
			"Could not parse AT response for %s, error: %d\n",
			at_cmd_pdp_context_read_info_cmd_str,
			ret);
		goto clean_exit;
	}

	/* Read primary DNS address */
	param_str_len = sizeof(dns_addr_str);
	ret = at_params_string_get(
		&param_list,
		AT_CMD_PDP_CONTEXT_READ_INFO_DNS_ADDR_PRIMARY_INDEX,
		dns_addr_str, &param_str_len);
	if (ret) {
		mosh_error(
			"Could not parse dns str for cid %d, err: %d",
			populated_info->cid, ret);
		goto clean_exit;
	}
	dns_addr_str[param_str_len] = '\0';

	if (dns_addr_str != NULL) {
		family = net_utils_sa_family_from_ip_string(dns_addr_str);

		if (family == AF_INET) {
			addr = &(populated_info->dns_addr4_primary);
			(void)inet_pton(AF_INET, dns_addr_str, addr);
		} else if (family == AF_INET6) {
			addr6 = &(populated_info->dns_addr6_primary);
			(void)inet_pton(AF_INET6, dns_addr_str, addr6);
		}
	}

	/* Read secondary DNS address */
	param_str_len = sizeof(dns_addr_str);

	ret = at_params_string_get(
		&param_list,
		AT_CMD_PDP_CONTEXT_READ_INFO_DNS_ADDR_SECONDARY_INDEX,
		dns_addr_str, &param_str_len);
	if (ret) {
		mosh_error("Could not parse dns str, err: %d", ret);
		goto clean_exit;
	}
	dns_addr_str[param_str_len] = '\0';

	if (dns_addr_str != NULL) {
		family = net_utils_sa_family_from_ip_string(dns_addr_str);

		if (family == AF_INET) {
			addr = &(populated_info->dns_addr4_secondary);
			(void)inet_pton(AF_INET, dns_addr_str, addr);
		} else if (family == AF_INET6) {
			addr6 = &(populated_info->dns_addr6_secondary);
			(void)inet_pton(AF_INET6, dns_addr_str, addr6);
		}
	}

	/* Read link MTU if exists:
	 * AT command spec:
	 * Note: If the PDN connection has dual stack capabilities, at least one pair of
	 * lines with information is returned per <cid>: First one line with the IPv4
	 * parameters followed by one line with the IPv6 parameters.
	 */
	if (iterator == 1) {
		ret = at_params_int_get(&param_list, AT_CMD_PDP_CONTEXT_READ_INFO_MTU_INDEX,
					&(populated_info->ipv6_mtu));
		if (ret) {
			/* Don't care if it fails: */
			ret = 0;
			populated_info->ipv6_mtu = 0;
		}
	} else {
		ret = at_params_int_get(&param_list, AT_CMD_PDP_CONTEXT_READ_INFO_MTU_INDEX,
					&(populated_info->ipv4_mtu));
		if (ret) {
			/* Don't care if it fails: */
			ret = 0;
			populated_info->ipv4_mtu = 0;
		}
	}

	if (resp_continues) {
		at_ptr = next_param_str;
		iterator++;
		if (iterator < lines && strncmp(next_param_str, "OK", 2)) {
			goto parse;
		}
	}

clean_exit:
	at_params_list_free(&param_list);

	return ret;
}

