nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_api.c
/* ****************************************************************************/

void link_api_coneval_read_for_shell(void)
{
	static const char * const coneval_result_strs[] = {
		"0: Connection evaluation successful",
		"1: Evaluation failed, no cell available",
		"2: Evaluation failed, UICC not available",
		"3: Evaluation failed, only barred cells available",
		"4: Evaluation failed, busy (e.g. GNSS activity)",
		"5: Evaluation failed, aborted because of higher priority operation",
		"6: Evaluation failed, not registered",
		"7: Evaluation failed, unspecified"
	};
	struct mapping_tbl_item const coneval_rrc_state_strs[] = {
		{ LTE_LC_RRC_MODE_IDLE,
		  "0: RRC connection in idle state during measurements" },
		{ LTE_LC_RRC_MODE_CONNECTED,
		  "1: RRC connection in connected state during measurements" },
		{ -1, NULL }
	};

	struct mapping_tbl_item const coneval_energy_est_strs[] = {
		{ LTE_LC_ENERGY_CONSUMPTION_EXCESSIVE,
		  "5: Energy estimate: -2, excessive energy consumption estimated" },
		{ LTE_LC_ENERGY_CONSUMPTION_INCREASED,
		  "6: Energy estimate: -1, slightly increased" },
		{ LTE_LC_ENERGY_CONSUMPTION_NORMAL,
		  "7: Energy estimate: 0, normal" },
		{ LTE_LC_ENERGY_CONSUMPTION_REDUCED,
		  "8: Energy estimate: +1, slightly reduced" },
		{ LTE_LC_ENERGY_CONSUMPTION_EFFICIENT,
		  "9: Energy estimate: +2, energy efficient transmission estimated" },
		{ -1, NULL }
	};

	struct mapping_tbl_item const coneval_tau_strs[] = {
		{ LTE_LC_CELL_IN_TAI_LIST,
		  "0: Evaluated cell is part of TAI list" },
		{ LTE_LC_CELL_NOT_IN_TAI_LIST,
		  "1: Evaluated cell is NOT part of TAI list, TAU will be triggered" },
		{ LTE_LC_CELL_UNKNOWN, "Unknown" },
		{ -1, NULL }
	};

	struct mapping_tbl_item const coneval_ce_level_strs[] = {
		{ LTE_LC_CE_LEVEL_0_NO_REPETITION,
		  "0: CE level 0, No repetitions or small nbr of repetitions" },
		{ LTE_LC_CE_LEVEL_1_LOW_REPETITION,
		  "1: CE level 1, Medium nbr of repetitions" },
		{ LTE_LC_CE_LEVEL_2_MEDIUM_REPETITION,
		  "2: CE level 2, Large nbr of repetitions" },
		{ 3, "3: CE level 3, Very large nbr of repetitions" },
		{ LTE_LC_CE_LEVEL_UNKNOWN, "Unknown" },
		{ -1, NULL }
	};
	struct lte_lc_conn_eval_params params;
	char snum[128];
	int ret;

	ret = lte_lc_conn_eval_params_get(&params);

	if (ret > 0) {
		mosh_error(
			"Cannot evaluate connection parameters, result: %s, ret %d",
			((ret <= 7) ? coneval_result_strs[ret] : "unknown"),
			ret);
		return;
	} else if (ret < 0) {
		mosh_error("lte_lc_conn_eval_params_get() API failed %d", ret);
		return;
	}

	mosh_print("Evaluated connection parameters:");
	mosh_print("  result:          %s",
			((ret <= 8) ? coneval_result_strs[ret] : "unknown"));
	mosh_print("  rrc_state:       %s",
			link_shell_map_to_string(coneval_rrc_state_strs, params.rrc_state, snum));
	mosh_print("  energy estimate: %s",
			link_shell_map_to_string(coneval_energy_est_strs,
				params.energy_estimate, snum));
	mosh_print("  rsrp:            %d: %ddBm", params.rsrp,
			(params.rsrp - MODEM_INFO_RSRP_OFFSET_VAL));
	mosh_print("  rsrq:            %d", params.rsrq);

	mosh_print("  snr:             %d: %ddB", params.snr,
			(params.snr - LINK_SNR_OFFSET_VALUE));
	mosh_print("  cell_id:         %d", params.cell_id);

	mosh_print("  mcc/mnc:         %d/%d", params.mcc, params.mnc);
	mosh_print("  phy_cell_id:     %d", params.phy_cid);
	mosh_print("  earfcn:          %d", params.earfcn);
	mosh_print("  band:            %d", params.band);
	mosh_print("  tau_triggered:   %s",
			link_shell_map_to_string(coneval_tau_strs, params.tau_trig, snum));
	mosh_print("  ce_level:        %s",
			link_shell_map_to_string(coneval_ce_level_strs, params.ce_level, snum));
	mosh_print("  tx_power:        %d", params.tx_power);
	mosh_print("  tx_repetitions:  %d", params.tx_rep);
	mosh_print("  rx_repetitions:  %d", params.rx_rep);
	mosh_print("  dl_pathloss:     %d", params.dl_pathloss);
}

/* ****************************************************************************/

/* For having a numeric constant in scanf string length */
#define L(x) STRINGIFY(x)

int link_api_xmonitor_read(struct lte_xmonitor_resp_t *resp)
{
	int ret = 0;
	int len;
	char tmp_cell_id_str[OP_CELL_ID_STR_MAX_LEN + 1] = { 0 };
	char tmp_tac_str[OP_TAC_STR_MAX_LEN + 1] = { 0 };

	memset(resp, 0, sizeof(struct lte_xmonitor_resp_t));

	/* All might not be included in a response if not camping on a cell,
	 * thus marking these specifically
	 */
	resp->rsrp = -1;
	resp->snr = -1;
	resp->pci = -1;
	resp->cell_id = -1;
	resp->tac = -1;

	ret = nrf_modem_at_scanf("AT%XMONITOR",
				 "%%XMONITOR: "
				 "%*u,"                                /* <reg_status>: ignored */
				 "%"L(OP_FULL_NAME_STR_MAX_LEN)"[^,]," /* <full_name> with quotes */
				 "%"L(OP_SHORT_NAME_STR_MAX_LEN)"[^,],"/* <short_name> with quotes*/
				 "%"L(OP_PLMN_STR_MAX_LEN)"[^,],"      /* <plmn> */
				 "%"L(OP_TAC_STR_MAX_LEN)"[^,],"       /* <tac> with quotes */
				 "%*d,"                                /* <AcT>: ignored */
				 "%u,"                                 /* <band> */
				 "%"L(OP_CELL_ID_STR_MAX_LEN)"[^,],"   /* <cell_id> with quotes */
				 "%u,"                                 /* <phys_cell_id> */
				 "%*u,"                                /* <EARFCN>: ignored */
				 "%d,"                                 /* <rsrp> */
				 "%d",                                 /* <snr> */
					resp->full_name_str,
					resp->short_name_str,
					resp->plmn_str,
					tmp_tac_str,
					&resp->band,
					tmp_cell_id_str,
					&resp->pci,
					&resp->rsrp,
					&resp->snr);
	if (ret < 0) {
		/* We don't want to print shell error from here, that should
		 * be done in a caller.
		 */
		return ret;
	}

	/* Strip out the quotes and convert to decimal */
	len = strlen(tmp_cell_id_str);
	if (len > 2 && len <= OP_CELL_ID_STR_MAX_LEN) {
		strncpy(resp->cell_id_str, tmp_cell_id_str + 1, len - 2);
		resp->cell_id = strtol(resp->cell_id_str, NULL, 16);
	}

	len = strlen(tmp_tac_str);
	if (len > 2 && len <= OP_TAC_STR_MAX_LEN) {
		strncpy(resp->tac_str, tmp_tac_str + 1, len - 2);
		resp->tac = strtol(resp->tac_str, NULL, 16);
	}

