nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_api.c
	return 0;
}

/* ****************************************************************************/

static void link_api_modem_operator_info_read_for_shell(void)
{
	struct lte_xmonitor_resp_t xmonitor_resp;
	int ret = link_api_xmonitor_read(&xmonitor_resp);

	if (ret) {
		mosh_error("link_api_xmonitor_read failed, result: ret %d", ret);
		return;
	}

	if (strlen(xmonitor_resp.full_name_str)) {
		mosh_print("Operator full name:   %s", xmonitor_resp.full_name_str);
	}

	if (strlen(xmonitor_resp.short_name_str)) {
		mosh_print("Operator short name:  %s", xmonitor_resp.short_name_str);
	}

	if (strlen(xmonitor_resp.plmn_str)) {
		mosh_print("Operator PLMN:        %s", xmonitor_resp.plmn_str);
	}

	if (xmonitor_resp.cell_id >= 0) {
		mosh_print("Current cell id:       %d (0x%s)", xmonitor_resp.cell_id,
			   xmonitor_resp.cell_id_str);
	}

	if (xmonitor_resp.pci >= 0) {
		mosh_print("Current phy cell id:   %d", xmonitor_resp.pci);
	}

	if (xmonitor_resp.band) {
		mosh_print("Current band:          %d", xmonitor_resp.band);
	}

	if (xmonitor_resp.tac >= 0) {
		mosh_print("Current TAC:           %d (0x%s)", xmonitor_resp.tac,
			   xmonitor_resp.tac_str);
	}

	if (xmonitor_resp.rsrp >= 0) {
		mosh_print(
			"Current rsrp:          %d: %ddBm",
			xmonitor_resp.rsrp,
			(xmonitor_resp.rsrp - MODEM_INFO_RSRP_OFFSET_VAL));
	}

	if (xmonitor_resp.snr >= 0) {
		mosh_print(
			"Current snr:           %d: %ddB",
			xmonitor_resp.snr,
			(xmonitor_resp.snr - LINK_SNR_OFFSET_VALUE));
	}
}

/* ****************************************************************************/

int link_api_pdp_contexts_read(struct pdp_context_info_array *pdp_info)
{
	int ret = 0;
	struct at_param_list param_list = { 0 };
	size_t param_str_len;
	char *next_param_str;
	bool resp_continues = false;

	char at_response_str[MOSH_AT_CMD_RESPONSE_MAX_LEN + 1];
	char *at_ptr = at_response_str;
	char *tmp_ptr = at_response_str;
	int pdp_cnt = 0;
	int iterator = 0;
	struct pdp_context_info *populated_info;

	char ip_addr_str[AT_CMD_PDP_CONTEXT_READ_IP_ADDR_STR_MAX_LEN];
	char *ip_address1, *ip_address2;
	int family;
	struct in_addr *addr4;
	struct in6_addr *addr6;

	memset(pdp_info, 0, sizeof(struct pdp_context_info_array));

	ret = nrf_modem_at_cmd(at_response_str, sizeof(at_response_str), AT_CMD_PDP_CONTEXTS_READ);
	if (ret) {
		mosh_error("nrf_modem_at_cmd returned err: %d", ret);
		return ret;
	}

	/* Check how many rows/context do we have: */
	while (strncmp(tmp_ptr, "OK", 2) &&
	       (tmp_ptr = strstr(tmp_ptr, AT_CMD_PDP_CONTEXT_READ_RSP_DELIM)) != NULL) {
		tmp_ptr += 2;
		pdp_cnt++;
	}

	/* Allocate array of PDP info accordingly: */
	pdp_info->array = calloc(pdp_cnt, sizeof(struct pdp_context_info));
	pdp_info->size = pdp_cnt;

	/* Parse the response */
	ret = at_params_list_init(&param_list, AT_CMD_PDP_CONTEXTS_READ_PARAM_COUNT);
	if (ret) {
		mosh_error("Could not init AT params list, error: %d\n", ret);
		return ret;
	}
	populated_info = pdp_info->array;

parse:
	resp_continues = false;
	ret = at_parser_max_params_from_str(
		at_ptr, &next_param_str, &param_list,
		AT_CMD_PDP_CONTEXTS_READ_PARAM_COUNT);
	if (ret == -EAGAIN) {
		resp_continues = true;
	} else if (ret != 0 && ret != -EAGAIN) {
		mosh_error("Could not parse AT response, error: %d", ret);
		goto clean_exit;
	}

	ret = at_params_int_get(&param_list,
				AT_CMD_PDP_CONTEXTS_READ_CID_INDEX,
				&populated_info[iterator].cid);
	if (ret) {
		mosh_error("Could not parse CID, err: %d", ret);
		goto clean_exit;
	}
	ret = pdn_id_get(populated_info[iterator].cid);
	if (ret < 0) {
		mosh_error(
			"Could not get PDN for CID %d, err: %d\n",
			populated_info[iterator].cid, ret);
	} else {
		populated_info[iterator].pdn_id_valid = true;
		populated_info[iterator].pdn_id = ret;
	}

	param_str_len = sizeof(populated_info[iterator].pdp_type_str);
	ret = at_params_string_get(
		&param_list, AT_CMD_PDP_CONTEXTS_READ_PDP_TYPE_INDEX,
		populated_info[iterator].pdp_type_str, &param_str_len);
	if (ret) {
		mosh_error("Could not parse pdp type, err: %d", ret);
		goto clean_exit;
	}
	populated_info[iterator].pdp_type_str[param_str_len] = '\0';

	populated_info[iterator].pdp_type = PDP_TYPE_UNKNOWN;
	if (strcmp(populated_info[iterator].pdp_type_str, "IPV4V6") == 0) {
		populated_info[iterator].pdp_type = PDP_TYPE_IP4V6;
	} else if (strcmp(populated_info[iterator].pdp_type_str, "IPV6") == 0) {
		populated_info[iterator].pdp_type = PDP_TYPE_IPV6;
	} else if (strcmp(populated_info[iterator].pdp_type_str, "IP") == 0) {
		populated_info[iterator].pdp_type = PDP_TYPE_IPV4;
	} else if (strcmp(populated_info[iterator].pdp_type_str, "Non-IP") == 0) {
		populated_info[iterator].pdp_type = PDP_TYPE_NONIP;
	}

	param_str_len = sizeof(populated_info[iterator].apn_str);
	ret = at_params_string_get(
		&param_list,
		AT_CMD_PDP_CONTEXTS_READ_APN_INDEX,
		populated_info[iterator].apn_str,
		&param_str_len);
	if (ret) {
		mosh_error("Could not parse apn str, err: %d", ret);
		goto clean_exit;
	}
	populated_info[iterator].apn_str[param_str_len] = '\0';

	param_str_len = sizeof(ip_addr_str);
	ret = at_params_string_get(
		&param_list, AT_CMD_PDP_CONTEXTS_READ_PDP_ADDR_INDEX,
		ip_addr_str, &param_str_len);
	if (ret) {
		mosh_error("Could not parse apn str, err: %d", ret);
		goto clean_exit;
	}
	ip_addr_str[param_str_len] = '\0';

	/* Parse IP addresses from space delimited string. */

	/* Get 1st 2 IP addresses from a CGDCONT string.
	 * Notice that ip_addr_str is slightly modified by strtok()
	 */
	ip_address1 = strtok(ip_addr_str, " ");
	ip_address2 = strtok(NULL, " ");

	if (ip_address1 != NULL) {
		family = net_utils_sa_family_from_ip_string(ip_address1);
		if (family == AF_INET) {
			struct in_addr *addr4 = &populated_info[iterator].ip_addr4;
			(void)inet_pton(AF_INET, ip_address1, addr4);
		} else if (family == AF_INET6) {
			struct in6_addr *addr6 = &populated_info[iterator].ip_addr6;

			(void)inet_pton(AF_INET6, ip_address1, addr6);
		}
	}
	if (ip_address2 != NULL) {
		/* Note: If we are here, PDP_addr_2 should be IPv6,
		 * thus in following ipv4 branch should not be possible:
		 */
		family = net_utils_sa_family_from_ip_string(ip_address2);
		if (family == AF_INET) {
			addr4 = &populated_info[iterator].ip_addr4;
			(void)inet_pton(AF_INET, ip_address2, addr4);
		} else if (family == AF_INET6) {
			addr6 = &populated_info[iterator].ip_addr6;
			(void)inet_pton(AF_INET6, ip_address2, addr6);
		}
	}

	/* Get DNS addresses etc.  for this IP context: */
	if (populated_info[iterator].pdp_type != PDP_TYPE_NONIP) {
		(void)link_api_pdp_context_dynamic_params_get(&(populated_info[iterator]));
	}

	if (resp_continues) {
		at_ptr = next_param_str;
		iterator++;
		if (iterator < pdp_cnt && strncmp(next_param_str, "OK", 2)) {
			goto parse;
		}
	}

	/* ...and finally, fill PDP context activation status for each: */
	link_api_context_info_fill_activation_status(pdp_info);

clean_exit:
	at_params_list_free(&param_list);
	/* user need do free pdp_info->array also in case of error */

	return ret;
}

/* *****************************************************************************/

void link_api_modem_info_get_for_shell(bool connected)
{
	struct pdp_context_info_array pdp_context_info_tbl;
	enum lte_lc_system_mode sys_mode_current;
	enum lte_lc_system_mode_preference sys_mode_preferred;
	enum lte_lc_lte_mode currently_active_mode;
	char info_str[MODEM_INFO_MAX_RESPONSE_SIZE + 1];
	int ret;

	(void)link_shell_get_and_print_current_system_modes(
		&sys_mode_current, &sys_mode_preferred, &currently_active_mode);

