nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_api.c
	ret = modem_info_string_get(MODEM_INFO_FW_VERSION, info_str, sizeof(info_str));
	if (ret >= 0) {
		mosh_print("Modem FW version:      %s", info_str);
	} else {
		mosh_error("Unable to obtain modem FW version (%d)", ret);
	}

	if (connected) {
		link_api_modem_operator_info_read_for_shell();

		ret = modem_info_string_get(MODEM_INFO_DATE_TIME, info_str, sizeof(info_str));
		if (ret >= 0) {
			mosh_print("Mobile network time and date: %s", info_str);
		}

		ret = link_api_pdp_contexts_read(&pdp_context_info_tbl);
		if (ret >= 0) {
			char ipv4_addr[NET_IPV4_ADDR_LEN];
			char ipv6_addr[NET_IPV6_ADDR_LEN];
			char ipv4_dns_addr_primary[NET_IPV4_ADDR_LEN];
			char ipv4_dns_addr_secondary[NET_IPV4_ADDR_LEN];
			char ipv6_dns_addr_primary[NET_IPV6_ADDR_LEN];
			char ipv6_dns_addr_secondary[NET_IPV6_ADDR_LEN];
			char tmp_str[12];

			int i = 0;
			struct pdp_context_info *info_tbl =
				pdp_context_info_tbl.array;

			for (i = 0; i < pdp_context_info_tbl.size; i++) {
				inet_ntop(AF_INET, &(info_tbl[i].ip_addr4),
					  ipv4_addr, sizeof(ipv4_addr));
				inet_ntop(AF_INET6, &(info_tbl[i].ip_addr6),
					  ipv6_addr, sizeof(ipv6_addr));

				inet_ntop(AF_INET,
					  &(info_tbl[i].dns_addr4_primary),
					  ipv4_dns_addr_primary,
					  sizeof(ipv4_dns_addr_primary));
				inet_ntop(AF_INET,
					  &(info_tbl[i].dns_addr4_secondary),
					  ipv4_dns_addr_secondary,
					  sizeof(ipv4_dns_addr_secondary));

				inet_ntop(AF_INET6,
					  &(info_tbl[i].dns_addr6_primary),
					  ipv6_dns_addr_primary,
					  sizeof(ipv6_dns_addr_primary));
				inet_ntop(AF_INET6,
					  &(info_tbl[i].dns_addr6_secondary),
					  ipv6_dns_addr_secondary,
					  sizeof(ipv6_dns_addr_secondary));

				if (info_tbl[i].pdn_id_valid) {
					sprintf(tmp_str, "%d", info_tbl[i].pdn_id);
				}

				/* Parsed PDP context info: */
				mosh_print("PDP context info %d:", (i + 1));
				mosh_print("  CID:                %d", info_tbl[i].cid);
				mosh_print("  PDN ID:             %s",
						(info_tbl[i].pdn_id_valid) ? tmp_str : "Not known");
				mosh_print("  PDP context active: %s",
						(info_tbl[i].ctx_active) ? "yes" : "no");
				mosh_print("  PDP type:           %s", info_tbl[i].pdp_type_str);
				mosh_print("  APN:                %s", info_tbl[i].apn_str);
				if (info_tbl[i].ipv4_mtu) {
					mosh_print("  IPv4 MTU:           %d",
						info_tbl[i].ipv4_mtu);
				}
				if (info_tbl[i].ipv6_mtu) {
					mosh_print("  IPv6 MTU:           %d",
						info_tbl[i].ipv6_mtu);
				}
				mosh_print("  IPv4 address:       %s", ipv4_addr);
				mosh_print("  IPv6 address:       %s", ipv6_addr);
				mosh_print("  IPv4 DNS address:   %s, %s",
						ipv4_dns_addr_primary, ipv4_dns_addr_secondary);
				mosh_print("  IPv6 DNS address:   %s, %s",
						ipv6_dns_addr_primary, ipv6_dns_addr_secondary);
			}
		} else {
			mosh_error("Unable to obtain pdp context info (%d)", ret);
		}
		if (pdp_context_info_tbl.array != NULL) {
			free(pdp_context_info_tbl.array);
		}
	}
}

int link_api_rai_status(bool *rai_status)
{
	int ret;
	int status;

	*rai_status = false;

	ret = nrf_modem_at_scanf("AT%RAI?", "%%RAI: %u", &status);
	if (ret < 0) {
		mosh_error("RAI AT command failed, error: %d", ret);
		return -EFAULT;
	} else if (ret < 1) {
		mosh_error("Could not parse RAI status, err %d", ret);
		return -EBADMSG;
	}
	*rai_status = (bool)status;
	return 0;
}
